## 시리즈와 불린 추출 사용하기

In [1]:
import pandas as pd

In [2]:
scientists = pd.read_csv('../data/scientists.csv')
scientists.head()

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56     Biologist

In [3]:
ages = scientists['Age']
print(ages)
print(ages.max()) # 가장 나이가 많은 나이는?

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64
90

In [4]:
print(ages.mean()) #평균

59.125

In [5]:
#평균 나이 보다 나이가 많은 사람의 데이터만 추출
print(ages[ages > ages.mean()])

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [6]:
#1, 2,3,7 인덱스의 데이터가 참(True)
print(ages > ages.mean())

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [7]:
print(type(ages > ages.mean()))

<class 'pandas.core.series.Series'>

In [8]:
#불린추출
#리스트 형태로 참, 거짓을 담아 시리즈에 전달하면 참인 인덱스의 데이터만 추출할 수 있다.
manal_bool_values = [True, True, False, False, True, True, False, True]
print(ages[manal_bool_values])

0    37
1    61
4    56
5    45
7    77
Name: Age, dtype: int64

In [9]:
scientists.sort_values(by='Age', ascending=True).head()

                Name        Born        Died  Age          Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
6        Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
5          John Snow  1813-03-15  1858-06-16   45           Physician
4      Rachel Carson  1907-05-27  1964-04-14   56           Biologist
1     William Gosset  1876-06-13  1937-10-16   61        Statistician

In [10]:
scientists.sort_values(by='Age', ascending=False).head()

                   Name        Born        Died  Age     Occupation
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
4         Rachel Carson  1907-05-27  1964-04-14   56      Biologist

## 벡터와 스칼라로 브로드캐스팅 수행하기
* 벡터 : 시리즈처럼 여러개의 값을 가진 데이터
* 스칼라 : 단순 크기를 나타내는 데이터

In [11]:
# 같은 길이의 벡터로 더하기, 곱하기 연산을 수행-결과값으로 같은 길이의 벡터를 출력
print(ages + ages)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [12]:
print(ages * ages)

0    1369
1    3721
2    8100
3    4356
4    3136
5    2025
6    1681
7    5929
Name: Age, dtype: int64

In [13]:
#벡터의 모든값에 스칼라 연산 - 브로드캐스팅한 결과
print(ages + 100)

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [14]:
print(ages * 2)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [15]:
#길이가 서로 다른 벡터를 연산
print(pd.Series([1,100]))

0      1
1    100
dtype: int64

In [16]:
#시리즈와 시리즈를 연산하는 경우 같은 인덱스 값만 계산
#인덱스가 일치하느 0,1만 계산 
#나머지는 인덱스를 계산 못하므로 누락값(NaN)으로 처리
print(ages + pd.Series([1, 100]))

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [17]:
#인덱스 역순 정렬
rev_ages = ages.sort_index(ascending=False) #
print(rev_ages)

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [18]:
print(ages * 2)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [19]:
#ages의 인덱스(0~7)와 rev_ages(0~7)의 인덱스가 일치하는 값끼리 연산
#벡터와 벧터의 연산은 일치하는 인덱스 값끼리 수행
print(ages + rev_ages)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

## 불린 추출과 브로드캐스팅

In [20]:
print(scientists[scientists['Age'] > scientists['Age'].mean()])

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [21]:
#인덱스가 2,4,5,6인 행 데이터는 bool값이 False라 출력되지 않음
print(scientists.loc[[True, True, False, True, False, False, False, True]])

                Name        Born        Died  Age     Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37        Chemist
1     William Gosset  1876-06-13  1937-10-16   61   Statistician
3        Marie Curie  1867-11-07  1934-07-04   66        Chemist
7       Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [22]:
# df 브로드캐스팅 - 정수 데이터는 2를 곱한 숫자가 되고,
#문자열 데이터는 문자열이 2배로 늘어남
print(scientists * 2)

                                       Name                  Born  \
0        Rosaline FranklinRosaline Franklin  1920-07-251920-07-25
1              William GossetWilliam Gosset  1876-06-131876-06-13
2  Florence NightingaleFlorence Nightingale  1820-05-121820-05-12
3                    Marie CurieMarie Curie  1867-11-071867-11-07
4                Rachel CarsonRachel Carson  1907-05-271907-05-27
5                        John SnowJohn Snow  1813-03-151813-03-15
6                    Alan TuringAlan Turing  1912-06-231912-06-23
7                  Johann GaussJohann Gauss  1777-04-301777-04-30

                   Died  Age                            Occupation
0  1958-04-161958-04-16   74                        ChemistChemist
1  1937-10-161937-10-16  122              StatisticianStatistician
2  1910-08-131910-08-13  180                            NurseNurse
3  1934-07-041934-07-04  132                        ChemistChemist
4  1964-04-141964-04-14  112                    BiologistBiologist
5  1858-06-161858-06-16   90                    PhysicianPhysician
6  1954-06-071954-06-07   82  Computer ScientistComputer Scientist
7  1855-02-231855-02-23  154            MathematicianMathematician

## 시리즈와 데이터프레임의 데이터 처리하기

In [23]:
#날짜가 문자열로 저장됨
print(scientists['Born'].dtype)
print(scientists['Died'].dtype)
print(scientists['Born'])

object
object
0    1920-07-25
1    1876-06-13
2    1820-05-12
3    1867-11-07
4    1907-05-27
5    1813-03-15
6    1912-06-23
7    1777-04-30
Name: Born, dtype: object

In [24]:
#시간 관련 작업을 할 수 있도록 datetime 자료형으로 변형
born_datetime = pd.to_datetime(scientists['Born'], format='%Y-%m-%d')
print(born_datetime)

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [25]:
died_datetime = pd.to_datetime(scientists['Died'], format='%Y-%m-%d')
print(died_datetime)

0   1958-04-16
1   1937-10-16
2   1910-08-13
3   1934-07-04
4   1964-04-14
5   1858-06-16
6   1954-06-07
7   1855-02-23
Name: Died, dtype: datetime64[ns]

In [26]:
scientists.head(n=3)

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse

In [27]:
#칼럼명을 추가하는 명령어 scientists['']
scientists['born_dt'],scientists['died_dt'] = (born_datetime, died_datetime)
scientists.head()

,Name,Born,Died,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14

In [28]:
print(scientists.shape)

(8, 7)

In [29]:
scientists['age_days_dt'] = (scientists['died_dt'] - scientists['born_dt'])
scientists

,Name,Born,Died,Age,Occupation,born_dt,died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,28422 days

## 시리즈, 데이터프레임의 데이터 섞기

In [30]:
print(scientists['Age'])

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [31]:
#seed 메서드는 컴퓨터가 생성하는 난수의 기준값을 정하기 위해 사용
import random
#random.seed(2023)
random.seed(42)
random.shuffle(scientists['Age'])
print(scientists['Age'])

0    66
1    56
2    41
3    77
4    90
5    45
6    37
7    61
Name: Age, dtype: int64

C:\ProgramData\anaconda3\lib\random.py:394: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x[i], x[j] = x[j], x[i]

## 데이터 프레임의 열 삭제하기

In [32]:
print(scientists.columns)

Index(['Name', 'Born', 'Died', 'Age', 'Occupation', 'born_dt', 'died_dt',
       'age_days_dt'],
      dtype='object')

In [33]:
#axis=0 행, axis=1 열을 의미
scientists_dropped = scientists.drop(['Age'], axis=1)

print(scientists_dropped.columns)

Index(['Name', 'Born', 'Died', 'Occupation', 'born_dt', 'died_dt',
       'age_days_dt'],
      dtype='object')

In [34]:
scientists_dropped.head()

,Name,Born,Died,Occupation,born_dt,died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,Biologist,1907-05-27,1964-04-14,20777 days

## 데이터를 피클, CSV, TSV파일로 저장하고 불러오기

### 1. 피클로 저장하기
* 바이너리 형태로 스프레드시트 보다 작은 용량으로 데이터를 저장
* 오래 보관한다는 의미로 붙여진 이름

In [35]:
names = scientists['Name']
names

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [36]:
names.to_pickle('../output/scientists_names_series.pickle')

In [37]:
scientists.to_pickle('../output/scientists_df.pickle')

In [38]:
scientists_names_from_pickle = pd.read_pickle('../output/scientists_names_series.pickle')
print(scientists_names_from_pickle)

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [39]:
sc = pd.read_pickle('../output/scientists_df.pickle')
print(sc)

                   Name        Born        Died  Age          Occupation  \
0     Rosaline Franklin  1920-07-25  1958-04-16   66             Chemist
1        William Gosset  1876-06-13  1937-10-16   56        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   41               Nurse
3           Marie Curie  1867-11-07  1934-07-04   77             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   90           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   37  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   61       Mathematician

     born_dt    died_dt age_days_dt
0 1920-07-25 1958-04-16  13779 days
1 1876-06-13 1937-10-16  22404 days
2 1820-05-12 1910-08-13  32964 days
3 1867-11-07 1934-07-04  24345 days
4 1907-05-27 1964-04-14  20777 days
5 1813-03-15 1858-06-16  16529 days
6 1912-06-23 1954-06-07  15324 days
7 1777-04-30 1855-02-23  28422 days

### 2. CSV 파일과 TSV파일로 저장하기

In [40]:
names.to_csv('../output/names_series.csv')

In [41]:
scientists.to_csv('../output/scientists_df.tsv', sep='\t')

In [42]:
scientists.to_csv('../output/scientists_df_no_index.csv', index=False)

In [43]:
import xlwt

In [44]:
#시리즈는 엑셀과 구조가 맞지 않기 때문에 엑셀 파일로 저장할 수 없습니다.
#엑셀 파일로 저장할 수 있는 df 구조로 변환
names_df = names.to_frame()
import xlwt
names_df.to_excel('../output/scientists_names_series_df.xls')

import openpyxl
names_df.to_excel('../output/scientists_names_series_df.xlsx')

C:\Users\Playdata\AppData\Local\Temp\ipykernel_12160\3292939327.py:5: FutureWarning: As the xlwt package is no longer maintained, the xlwt engine will be removed in a future version of pandas. This is the only engine in pandas that supports writing in the xls format. Install openpyxl and write to an xlsx file instead. You can set the option io.excel.xls.writer to 'xlwt' to silence this warning. While this option is deprecated and will also raise a warning, it can be globally set and the warning suppressed.
  names_df.to_excel('../output/scientists_names_series_df.xls')

# 행 인덱스/열 이름 설정
### pandas.DataFrame(2차원배열, index = 행 인덱스 배열, colums = 열 이름 배열)

# 행/열 삭제
* 행을 삭제할 때는 축(axis) 옵션 axis=0 (생략가능)
* 행 삭제:DataFrame 객체.drop(행 인덱스 또는 배열, axis=0)
* 열을 삭제할 때는 축(axis) 옵션 axis=1
* 열 삭제:DataFrame 객체.drop(열 이름 또는 배열, axis=1)

## 원본객체를 직접 변경하기 위해서는 inplace=True 옵션추가

<img src ='../img/11.PNG'>